# Groupby

*The **groupby** method allows you to group rows of data together and call aggregate functions.*<br>
This can be used to group large amounts of data and compute operations on these groups.

In [1]:
# Importing pandas Library
import pandas as pd

In [2]:
# Create dataframe
df = pd.DataFrame({'Company':['A','A','B','B','C','C'],
       'Person':['a','b','c','d','e','f'],
       'Sales':[200,120,340,124,243,350]})

In [3]:
# View DataFrame
df

  Company Person  Sales
0       A      a    200
1       A      b    120
2       B      c    340
3       B      d    124
4       C      e    243
5       C      f    350

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Person   6 non-null      object
 2   Sales    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

Now you can use the **.groupby()** method to group rows together based off of a column name.<br>
For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [5]:
df.groupby('Company');

In [6]:
#You can save this object as a new variable:
by_comp = df.groupby("Company")

In [7]:
#And then call aggregate methods off the object:
by_comp.mean()

         Sales
Company
A        160.0
B        232.0
C        296.5

In [8]:
df.groupby('Company').mean()

         Sales
Company
A        160.0
B        232.0
C        296.5

**More examples of aggregate methods:**

In [9]:
by_comp.std()

              Sales
Company
A         56.568542
B        152.735065
C         75.660426

In [10]:
by_comp.count()

         Person  Sales
Company
A             2      2
B             2      2
C             2      2

In [11]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
A         2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
B         2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
C         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0

In [12]:
by_comp.describe().transpose()

Company               A           B           C
Sales count    2.000000    2.000000    2.000000
      mean   160.000000  232.000000  296.500000
      std     56.568542  152.735065   75.660426
      min    120.000000  124.000000  243.000000
      25%    140.000000  178.000000  269.750000
      50%    160.000000  232.000000  296.500000
      75%    180.000000  286.000000  323.250000
      max    200.000000  340.000000  350.000000

In [13]:
by_comp.describe().transpose()['A']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: A, dtype: float64

                                            - Thank You and Happy Learning -
                                      - Please Subscribe and Support This Channnel-